//+  1. Користувач вводить або має два числа.
//      Потрібно знайти та вивести максимальне число з тих двох .
//      Також потрібно врахувати коли введені рівні числа.
//     let firstNumber = +prompt('Введіть перше число');
//     let secondNumber = +prompt('Введіть друге число');
//         if (firstNumber > secondNumber) {
//             console.log(firstNumber);
//         } else if (firstNumber === secondNumber) {
//             console.log('Ви ввели однакові числа');
//         } else {
//             console.log(secondNumber);
//         }

//+  2. У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
//      Користувач вводить номер квартири просто в змінні або через prompt('').
//      Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//     let apartmentNumber = +prompt('Введіть номер квартири від 1-ї до 90-ї');
//         if (apartmentNumber >= 1 && apartmentNumber <= 20) {
//             console.log('Ця квартира знаходиться в першому підїзді');
//         } else if (apartmentNumber >= 21 && apartmentNumber <= 48) {
//             console.log('Ця квартира знаходиться в другому підїзді');
//         } else if (apartmentNumber >= 49 && apartmentNumber <= 90) {
//             console.log('Ця квартира знаходиться в третьому підїзді');
//         } else {
//             console.log('В цьому домі немає квартири під таким номером!')
//         }

//+  3. Ми маємо змінну number в яку користувач задає числове значення,
//      якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//     let number = +prompt('Введіть число від 1 до 10');
//     (number === 10) ? console.log('Вірно') : console.log('Не вірно');

//+  4. Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//      Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ.
//      Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//     let value = +prompt('Чи ми йдемо сьогодні в OKTEN на навчання? Яка температура зараз на дворі?');
//         if (value >= 10 && value <= 22) {
//             console.log('Так, ми йдемо ВЧИТИСЯ!');
//         } else {
//             console.log('Нажаль, ми сидимо вдома і вчимося ОНЛАЙН!')
//         }

//+  5. За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5.
//      І в залежності від введеного числа нам дається приз. (Авто, Мото, Телефон, і т.д) і якщо число не підходить,
//      тоді вивести Повідомлення - що число не вірне ....
//     let playGame = +prompt('Для отримання призу введіть число від 1 до 5. Нехай щастить!');
//         switch (playGame) {
//             case 1:
//                 console.log('Вітаю, Ви виграли автомобіль!');
//                 break;
//             case 2:
//                 console.log('Вітаю, Ви виграли мотоцикл!');
//                 break;
//             case 3:
//                 console.log('Вітаю, Ви виграли телефон!');
//                 break;
//             case 4:
//                 console.log('Вітаю, Ви виграли телевізор!');
//                 break;
//             case 5:
//                 console.log('Вітаю, Ви виграли подорож!');
//                 break;
//             default:
//                 console.log('Нажаль, Ви ввели число що не входить в зазначений діапазон!')
//         }