//+  1. Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті
//      години попадає число (в першу, другу, третю или четверту частину години).
//     let time = +prompt('Введіть число від 1 до 59');
//         if (time >= 1 && time <= 14) {
//             console.log('Вітаю, зараз перша четверть години');
//         } else if (time >= 15 && time <= 29) {
//             console.log('Вітаю, зараз друга четверть години');
//         } else if (time >= 30 && time <= 44) {
//             console.log('Вітаю, зараз третя четверть години');
//         } else if (time >= 45 && time <= 59) {
//             console.log('Вітаю, зараз четверта четверть години');
//         } else {
//             console.log('Будьте уважні при введенні, потрібно ввести від 1 до 59!!!')
//         }

//+  2. У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину (декаду)
//      місяця потрапляє це число (у першу, другу чи третю).
//     let day = +prompt('Введіть число місяця!');
//         if (day >= 1 && day <= 10) {
//             document.write('Введене Вами число місяця знаходиться в першій декаді!');
//         } else if (day >= 11 && day <= 20) {
//             document.write('Введене Вами число місяця знаходиться в другій декаді!')
//         } else if (day >= 21 && day <= 31) {
//             document.write('Введене Вами число місяця знаходиться в третій декаді!')
//         } else if (day == '') {
//             document.write('І всетаки треба ввести від 1 до 31!')
//         } else {
//             document.write('Та ж не має місяць більше 31-го дня!! Уважно поставтесь до завдання!!!')
//         }

//+  3. У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//      Перевірте роботу скрипта при test, що дорівнює true, false.
//      Напишіть два варіанти скрипта - з коротким записом (тернаркою)
//     let test = '';
//         if (test) {
//             console.log('Вірно');
//         } else {
//             console.log('Неправильно');
//         }
//     let test2 = '' ? 'Вірно' : 'Неправильно';
//         console.log(test2);

//+  4. Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
//      Перевірте скрипт при a, що дорівнює 1, 0, -3
//     let a = +prompt('Введіть 1, 0, -3');
//         if (a !== 0) {
//             console.log('Вірно');
//         } else {
//             console.log('Не вірно');
//         }
//     (a !== 0) ? console.log('Вірно') : console.log('Не вірно');

//+  5. Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані
//      відображається інфа що заплановано на цей день.
//     let value = prompt('Введи день тижня, до прикладу: monday, tuesday і тд.');
//     switch (value) {
//         case 'monday':
//             console.log('В тебе сьогодні поїдка в гори');
//             break;
//         case 'tuesday':
//             console.log('В тебе сьогодні екзамен з історії');
//             break;
//         case 'wednesday':
//             console.log('В тебе сьогодні похід до стоматолога');
//             break;
//         case 'thursday':
//             console.log('Тобі сьогодні потрібно записатись на курси в octen');
//             break;
//         case 'friday':
//             console.log('В тебе сьогодні зустріч з друзями');
//             break;
//         case 'saturday':
//             console.log('В тебе сьогодні домашні справи, приготуй щось смачне');
//             break;
//         case 'sunday':
//             console.log('В тебе сьогодні вихідний');
//             break;
//         default:
//             console.log('Нема такого дня в тижні, мабуть ти ввів щось не те!')
//     }

//+  6. Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
//     let leapYear = +prompt('Введіть рік для визначення чи він високосний');
//     (leapYear%4 === 0) ? console.log('Так, цей рік високосний!') : console.log('Ні, цей рік не є високосним!');

//+  7. Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
//      Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
//     let answer = prompt('Яка «офіційна» назва JavaScript?');
//         if (answer === 'ECMAScript') {
//             console.log('Правильно!');
//         } else {
//             console.log('Не знаєте? ECMAScript!');
//         }